app/controllers/teams_controller.rb

  def create
    @team = Team.new(team_params)

      respond_to do |format|
        if @team.save!
---
INSERT INTO "teams" ("name", "sport", "city", "logo_url", "venue_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @team = Team.find(params[:id])

      respond_to do |format|
        if @team.update!(team_params)
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "teams" SET "name" = $1, "updated_at" = $2 WHERE "teams"."id" = $3  [["name", "Houston Rocketsssssssss"], ["updated_at", "2017-06-25 16:37:44.356043"], ["id", 5]]

  def destroy
    @team = Team.find(params[:id])
    @team.destroy
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "teams" WHERE "teams"."id" = $1  [["id", 4]]