app/controllers/venues_controller.rb

  def show
    @venue = Venue.find(params[:id])
---
SELECT  "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @venue = Venue.new(venue_params)

      respond_to do |format|
        if @venue.save!
---
INSERT INTO "venues" ("name", "location", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "jhdjahs"], ["location", "ahsdjashd"], ["description", "huahds"], ["created_at", "2017-06-26 16:38:52.295231"], ["updated_at", "2017-06-26 16:38:52.295231"]]

  def update
    @venue = Venue.find(params[:id])

      respond_to do |format|
        if @venue.update!(venue_params)
---
SELECT  "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "venues" SET "location" = $1, "updated_at" = $2 WHERE "venues"."id" = $3  [["location", "Washington DC"], ["updated_at", "2017-06-26 16:33:49.802776"], ["id", 118]]

  def destroy
    @venue = Venue.find(params[:id])
    @venue.destroy
---
SELECT  "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "venues" WHERE "venues"."id" = $1  [["id", 4]]